trainingExperts/1_trainingNPSexpert/inputs/baseline/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "1";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
10368
(
(0.690898 9.38426e-05 0)
(0.708448 9.67352e-05 0)
(0.7028 9.58076e-05 0)
(0.696599 9.43117e-05 6.10963e-25)
(0.690586 9.16063e-05 -6.56347e-25)
(0.683928 8.53283e-05 1.47931e-24)
(0.675224 7.12142e-05 -1.65396e-24)
(0.662476 4.22952e-05 0)
...
)
;

boundaryField
{
    back
    {
        type            empty;
    }
    down
    {
        type            noSlip;
    }
    front
    {
        type            empty;
    }
    inlet
    {
        type            timeVaryingMappedFixedValue;
        fieldTable      U;
        value           nonuniform List<vector> 
54
(
(34.5919 0 0)
(34.5929 0 0)
(34.5942 0 0)
(34.5956 0 0)
(34.5968 0 0)
(34.5979 0 0)
(34.5988 0 0)
(34.5995 0 0)
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    up
    {
        type            slip;
    }
}


// ************************************************************************* //
