trainingExperts/1_trainingNPSexpert/inputs/baseline/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "1";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
10368
(
34.6834
32.5951
31.9055
31.5683
31.4163
31.7163
32.9164
35.6167
...
)
;

boundaryField
{
    back
    {
        type            empty;
    }
    down
    {
        type            zeroGradient;
    }
    front
    {
        type            empty;
    }
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    up
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
