trainingExperts/1_trainingNPSexpert/inputs/baseline/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "1";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
10368
(
0.0140925
0.0148414
0.0146051
0.0143466
0.0140978
0.0138254
0.0134739
0.0129681
...
)
;

boundaryField
{
    back
    {
        type            empty;
    }
    down
    {
        type            fixedValue;
        value           uniform 1e-08;
    }
    front
    {
        type            empty;
    }
    inlet
    {
        type            timeVaryingMappedFixedValue;
        fieldTable      k;
        value           nonuniform List<scalar> 
54
(
0.000546372
0.000546383
0.000546401
0.000546417
0.000546429
0.000546423
0.000546412
0.000546411
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    up
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
