trainingExperts/1_trainingNPSexpert/inputs/baseline/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "1";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
10368
(
5.10898e-10
5.38048e-10
5.29481e-10
5.20109e-10
5.11088e-10
5.0121e-10
4.88468e-10
4.7013e-10
...
)
;

boundaryField
{
    back
    {
        type            empty;
    }
    down
    {
        type            fixedValue;
        value           uniform 1e-08;
    }
    front
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
54
(
2.38134e-06
2.38135e-06
2.38138e-06
2.38141e-06
2.38142e-06
2.38137e-06
2.38133e-06
2.38134e-06
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
54
(
3.70217e-10
1.38541e-09
2.46007e-08
2.13122e-07
1.04736e-06
3.20219e-06
7.06618e-06
1.2829e-05
...
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<scalar> 
192
(
2.57779e-06
2.59446e-06
2.6074e-06
2.61972e-06
2.63428e-06
2.64598e-06
2.66038e-06
2.67256e-06
...
)
;
    }
}


// ************************************************************************* //
