trainingExperts/1_trainingNPSexpert/inputs/baseline/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    //default         Euler;
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;

    div(phi,U)      	    Gauss limitedLinearV 1;
    div(U)                  Gauss linear;
    //div(phi,U)          bounded Gauss linearUpwind grad(U);
    //div(phi,U)            Gauss linear;
    //div(phi,U)              Gauss upwind;
    div(nonlinearStress)    Gauss linear;
    //turbulence              Gauss limitedLinear 1;
    turbulence              Gauss upwind;
    div(phi,omega) 	        $turbulence;
    div(phi,k)              $turbulence;


    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method          meshWave;
}


// ************************************************************************* //
